# WaterBumpAmount Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Water..::..WaterBumpAmount Property
Water Class See Also
---
The property labeled "Wave Height" from the "Water" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string WaterBumpAmount { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WaterBumpAmount As String
	Get
```

Visual C++
---
```text
public:
static property String^ WaterBumpAmount {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyDouble" within the range of "0, 5".
# See Also
Water Class
Autodesk.Revit.DB.Visual Namespace